Tekla.Structures.ModelInternal.RebarPropertyStrip.PropertyStripFlags
The property strip flags enum.

Tekla.Structures.ModelInternal.RebarPropertyStrip.PropertyStripFlags.Name
The name flag.

Tekla.Structures.ModelInternal.RebarPropertyStrip.PropertyStripFlags.Class
The class flag.

Tekla.Structures.ModelInternal.RebarPropertyStrip.PropertyStripFlags.Grade
The grade flag.

Tekla.Structures.ModelInternal.RebarPropertyStrip.PropertyStripFlags.Size
The size flag.

Tekla.Structures.ModelInternal.RebarPropertyStrip.PropertyStripFlags.BendingRadius
The bending radius flag.

Tekla.Structures.ModelInternal.RebarPropertyStrip.PropertyStripFlags.Finish
The finish flag.

Tekla.Structures.ModelInternal.RebarPropertyStrip.PropertyStripFlags.Prefix
The prefix flag.

Tekla.Structures.ModelInternal.RebarPropertyStrip.PropertyStripFlags.StartNumber
The start number flag.